physics/idealgas.org
#+TITLE: Thermodynamics
#+STARTUP: latexpreview
#+OPTIONS: toc:nil

* Boring

\[
T_F = \frac{9}{5}T_C +32
\]

** Thermal expansion

\[
\Delta L = L \alpha \Delta T
\]

\[
\Delta V = V \beta \Delta T
\]



* First law of thermodynamics

Work done by a gas

\[
W = \int \dd W = \int_{v_i}^{v_f} p \dd{V}
\]


First law of thermodynamics

\[
dE_{int} = dQ-dW
\]

where W is the work done by the system


** Special cases

*** Adiabatic process

\[
\Delta E_{int} = -W
\]

when Q=0 (occurs rapidly or is very well insulated)

*** Constant-volume processes

\[
\Delta E_{int} = Q
\]

*** Cyclical process

\[
Q=W
\]

No change in internal energy

*** Free expansions

\[
\Delta E_{int} = 0
\]

Q=W=0

Adiabatic processes


* Heat transfer

** Conduction

\[
P_{cond} = \frac{Q}{t} = kA\frac{T_H-T_C}{L}
\]

where P is the conduction rate, k is the thermal conductivity, and T is temperature of the hot and cold reservoirs.
A and L is the area surface area and length of the conducting slab

R-value (Thermal Resistance) is defined as $\frac{L}{k}$ for a material of specified thickness


For a conduction slab made up of multiple slabs:

\[
P_{cond} = \frac{A(T_H-T_C)}{\sum (L/k)}
\]

assuming thermal conduction is in the steady state (all energy absorbed is conducted away)

Greater the thermal conductivity, the smaller the temperature difference between reservoirs


** Convection

Trivial

** Radiation
\[
P_{rad} = \sigma \epsilon A T^4
\]

where $\sigma = 5.6704 \times 10^{-8} W/m^2 \cdot K^4$ (Stefan-Boltzmann constant),
$\epsilon$ represents the emissivity of the object's surface, which is a value from 0-1.

A surface with a maximum emissivity of 1.0 is a blackbody radiator.


\[
P_{abs} = \sigma \epsilon A T_{env}^4
\]

A blackbody would absorb all the radiated energy it intercepts

Thus:

\[
P_{net} = P_{abs} - P_{rad}
\]
