exports/physics/idealgas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-16 Mon 17:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Thermodynamics</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Thermodynamics</h1>

<div id="outline-container-org71c9ca1" class="outline-2">
<h2 id="org71c9ca1"><span class="section-number-2">1</span> Boring</h2>
<div class="outline-text-2" id="text-1">
<p>
\[
T_F = \frac{9}{5}T_C +32
\]
</p>
</div>

<div id="outline-container-org7bfcbd9" class="outline-3">
<h3 id="org7bfcbd9"><span class="section-number-3">1.1</span> Thermal expansion</h3>
<div class="outline-text-3" id="text-1-1">
<p>
\[
\Delta L = L \alpha \Delta T
\]
</p>

<p>
\[
\Delta V = V \beta \Delta T
\]
</p>
</div>
</div>
</div>



<div id="outline-container-orge6441fd" class="outline-2">
<h2 id="orge6441fd"><span class="section-number-2">2</span> First law of thermodynamics</h2>
<div class="outline-text-2" id="text-2">
<p>
Work done by a gas
</p>

<p>
\[
W = \int \dd W = \int_{v_i}^{v_f} p \dd{V}
\]
</p>


<p>
First law of thermodynamics
</p>

<p>
\[
dE_{int} = dQ-dW
\]
</p>

<p>
where W is the work done by the system
</p>
</div>


<div id="outline-container-orgb42d894" class="outline-3">
<h3 id="orgb42d894"><span class="section-number-3">2.1</span> Special cases</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org5e07d9e" class="outline-4">
<h4 id="org5e07d9e"><span class="section-number-4">2.1.1</span> Adiabatic process</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
\[
\Delta E_{int} = -W
\]
</p>

<p>
when Q=0 (occurs rapidly or is very well insulated)
</p>
</div>
</div>

<div id="outline-container-org6634bb0" class="outline-4">
<h4 id="org6634bb0"><span class="section-number-4">2.1.2</span> Constant-volume processes</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
\[
\Delta E_{int} = Q
\]
</p>
</div>
</div>

<div id="outline-container-org7b94846" class="outline-4">
<h4 id="org7b94846"><span class="section-number-4">2.1.3</span> Cyclical process</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
\[
Q=W
\]
</p>

<p>
No change in internal energy
</p>
</div>
</div>

<div id="outline-container-orgbe15634" class="outline-4">
<h4 id="orgbe15634"><span class="section-number-4">2.1.4</span> Free expansions</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
\[
\Delta E_{int} = 0
\]
</p>

<p>
Q=W=0
</p>

<p>
Adiabatic processes
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-org6cc0eab" class="outline-2">
<h2 id="org6cc0eab"><span class="section-number-2">3</span> Heat transfer</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org082d3c5" class="outline-3">
<h3 id="org082d3c5"><span class="section-number-3">3.1</span> Conduction</h3>
<div class="outline-text-3" id="text-3-1">
<p>
\[
P_{cond} = \frac{Q}{t} = kA\frac{T_H-T_C}{L}
\]
</p>

<p>
where P is the conduction rate, k is the thermal conductivity, and T is temperature of the hot and cold reservoirs.
A and L is the area surface area and length of the conducting slab
</p>

<p>
R-value (Thermal Resistance) is defined as \(\frac{L}{k}\) for a material of specified thickness
</p>


<p>
For a conduction slab made up of multiple slabs:
</p>

<p>
\[
P_{cond} = \frac{A(T_H-T_C)}{\sum (L/k)}
\]
</p>

<p>
assuming thermal conduction is in the steady state (all energy absorbed is conducted away)
</p>

<p>
Greater the thermal conductivity, the smaller the temperature difference between reservoirs
</p>
</div>
</div>


<div id="outline-container-org8062b2f" class="outline-3">
<h3 id="org8062b2f"><span class="section-number-3">3.2</span> Convection</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Trivial
</p>
</div>
</div>

<div id="outline-container-orge121994" class="outline-3">
<h3 id="orge121994"><span class="section-number-3">3.3</span> Radiation</h3>
<div class="outline-text-3" id="text-3-3">
<p>
\[
P_{rad} = \sigma \epsilon A T^4
\]
</p>

<p>
where \(\sigma = 5.6704 \times 10^{-8} W/m^2 \cdot K^4\) (Stefan-Boltzmann constant),
\(\epsilon\) represents the emissivity of the object's surface, which is a value from 0-1.
</p>

<p>
A surface with a maximum emissivity of 1.0 is a blackbody radiator.
</p>


<p>
\[
P_{abs} = \sigma \epsilon A T_{env}^4
\]
</p>

<p>
A blackbody would absorb all the radiated energy it intercepts
</p>

<p>
Thus:
</p>

<p>
\[
P_{net} = P_{abs} - P_{rad}
\]
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-08-16 Mon 17:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
